In [78]:
import pandas as pd
import numpy as np

In [79]:
students_01 = pd.read_csv("data/students_1.csv")
students_02 = pd.read_csv("data/students_2.csv")

In [80]:
# first dataset
students_01

  student_id  average grade
0       00A1       95     A
1       00B2       80     B
2       00C3       75     C

In [81]:
# second dataset (last student_id is not in 'students_01' dataset)
students_02

  student_id  year_group
0       00A1        1995
1       00B2        1996
2       00C3        1997
3       00D4        1998

In [82]:
# merge the two dataframes into one, using 'student_id' as the key (full outer join - union of keys of both frames)
result = pd.merge(students_01, students_02, how='outer', on='student_id')
result

  student_id  average grade  year_group
0       00A1     95.0     A        1995
1       00B2     80.0     B        1996
2       00C3     75.0     C        1997
3       00D4      NaN   NaN        1998

In [83]:
# merge the two dataframes into one, using student_id as the key (inner join - intersection of keys)
result = pd.merge(students_01,students_02, how='inner', on='student_id')
result

  student_id  average grade  year_group
0       00A1       95     A        1995
1       00B2       80     B        1996
2       00C3       75     C        1997